n = int(input("Введите к-во копеек от 0 до 99:   "))
if 0 <= n <= 99:
    s = n % 10
    if (s == 1) and (n != 0) and (n != 11) and (n != 12) and (n != 13) and (n != 14):
        print(n, "копейка")
        print(s)
        print(n)
    elif (2 <= s <= 4) and (n != 0) and (n != 11) and (n != 12) and (n != 13) and (n != 14):
        print(n, "копейки")
        print(s)
        print(n)
    else:
        print(n, "копеек")
        print(s)
        print(n)
else:
    print("Значения введены неверно!")

# копейка 1 21 31 41 51 61 71 81 91

# копейки 2 22 32 42 52 62 72 82 92
#         3 23 33 43 53 63 73 83 93
#         4 24 34 44 54 64 74 84 94

# копеек 5 15 25 35 45 55 65 75 85 95
#        6 16 26 36 46 56 66 76 86 96
#        7 17 27 37 47 57 67 77 87 97
#        8 18 28 38 48 58 68 78 88 98
#        9 19 29 39 49 59 69 79 89 99
#        10 20 30 40 50 60 70 80 90
#        11 12 13 14 0
